louqingjie/PIE-Block/vendor/keil-toolchain/C251/INC/STC/STC8051U.H
#ifndef __STC8051U_H__
#define __STC8051U_H__

/////////////////////////////////////////////////

#include "stdio.h"
#include "intrins.h"
#include "string.h"

//修正编译器的LCALL 0x0000异常
extern void _m(void);
#define main(x) main(x){_m();sprintf(0, "0");strlen("0");}; void _m(x)

/////////////////////////////////////////////////

sfr         P0          =           0x80;
    sbit    P00         =           P0^0;
    sbit    P01         =           P0^1;
    sbit    P02         =           P0^2;
    sbit    P03         =           P0^3;
    sbit    P04         =           P0^4;
    sbit    P05         =           P0^5;
    sbit    P06         =           P0^6;
    sbit    P07         =           P0^7;

sfr         SP          =           0x81;
sfr         DPL         =           0x82;
sfr         DPH         =           0x83;
sfr         DPXL        =           0x84;
sfr         SPH         =           0x85;

sfr         PCON        =           0x87;
    sbit    SMOD        =           PCON^7;
    sbit    SMOD0       =           PCON^6;
    sbit    LVDF        =           PCON^5;
    sbit    POF         =           PCON^4;
    sbit    GF1         =           PCON^3;
    sbit    GF0         =           PCON^2;
    sbit    PD          =           PCON^1;
    sbit    IDL         =           PCON^0;

sfr         TCON        =           0x88;
    sbit    TF1         =           TCON^7;
    sbit    TR1         =           TCON^6;
    sbit    TF0         =           TCON^5;
    sbit    TR0         =           TCON^4;
    sbit    IE1         =           TCON^3;
    sbit    IT1         =           TCON^2;
    sbit    IE0         =           TCON^1;
    sbit    IT0         =           TCON^0;

sfr         TMOD        =           0x89;
    sbit    T1_GATE     =           TMOD^7;
    sbit    T1_CT       =           TMOD^6;
    sbit    T1_M1       =           TMOD^5;
    sbit    T1_M0       =           TMOD^4;
    sbit    T0_GATE     =           TMOD^3;
    sbit    T0_CT       =           TMOD^2;
    sbit    T0_M1       =           TMOD^1;
    sbit    T0_M0       =           TMOD^0;

sfr         TL0         =           0x8a;
sfr         TL1         =           0x8b;
sfr         TH0         =           0x8c;
sfr         TH1         =           0x8d;

sfr         AUXR        =           0x8e;
    sbit    T0x12       =           AUXR^7;
    sbit    T1x12       =           AUXR^6;
    sbit    S1M0x6      =           AUXR^5;
    sbit    T2R         =           AUXR^4;
    sbit    T2_CT       =           AUXR^3;
    sbit    T2x12       =           AUXR^2;
    sbit    EXTRAM      =           AUXR^1;
    sbit    S1BRT       =           AUXR^0;

sfr         INTCLKO     =           0x8f;
    sbit    EX4         =           INTCLKO^6;
    sbit    EX3         =           INTCLKO^5;
    sbit    EX2         =           INTCLKO^4;
    sbit    T2CLKO      =           INTCLKO^2;
    sbit    T1CLKO      =           INTCLKO^1;
    sbit    T0CLKO      =           INTCLKO^0;

sfr         P1          =           0x90;
    sbit    P10         =           P1^0;
    sbit    P11         =           P1^1;
    sbit    P12         =           P1^2;
    sbit    P13         =           P1^3;
    sbit    P14         =           P1^4;
    sbit    P15         =           P1^5;
    sbit    P16         =           P1^6;
    sbit    P17         =           P1^7;

sfr         P1M1        =           0x91;
sfr         P1M0        =           0x92;
sfr         P0M1        =           0x93;
sfr         P0M0        =           0x94;
sfr         P2M1        =           0x95;
sfr         P2M0        =           0x96;

sfr         AUXR2       =           0x97;
    sbit    RAMTINY     =           AUXR2^7;
    sbit    CPUMODE     =           AUXR2^6;
    sbit    RAMEXE      =           AUXR2^5;
    sbit    CANFD       =           AUXR2^4;
    sbit    CANSEL      =           AUXR2^3;
    sbit    CAN2EN      =           AUXR2^2;
    sbit    CANEN       =           AUXR2^1;
    sbit    LINEN       =           AUXR2^0;

sfr         SCON        =           0x98;
    sbit    SM0         =           SCON^7;
    sbit    SM1         =           SCON^6;
    sbit    SM2         =           SCON^5;
    sbit    REN         =           SCON^4;
    sbit    TB8         =           SCON^3;
    sbit    RB8         =           SCON^2;
    sbit    TI          =           SCON^1;
    sbit    RI          =           SCON^0;

sfr         SBUF        =           0x99;

sfr         S2CON       =           0x9a;
    sbit    S2SM0       =           S2CON^7;
    sbit    S2SM1       =           S2CON^6;
    sbit    S2SM2       =           S2CON^5;
    sbit    S2REN       =           S2CON^4;
    sbit    S2TB8       =           S2CON^3;
    sbit    S2RB8       =           S2CON^2;
    sbit    S2TI        =           S2CON^1;
    sbit    S2RI        =           S2CON^0;

sfr         S2BUF       =           0x9b;

sfr         IRCBAND     =           0x9d;
    sbit    USBCKS      =           IRCBAND^7;
    sbit    USBCKS2     =           IRCBAND^6;
    sbit    HIRCSEL1    =           IRCBAND^1;
    sbit    HIRCSEL0    =           IRCBAND^0;

sfr         LIRTRIM     =           0x9e;
sfr         IRTRIM      =           0x9f;

sfr         P2          =           0xa0;
    sbit    P20         =           P2^0;
    sbit    P21         =           P2^1;
    sbit    P22         =           P2^2;
    sbit    P23         =           P2^3;
    sbit    P24         =           P2^4;
    sbit    P25         =           P2^5;
    sbit    P26         =           P2^6;
    sbit    P27         =           P2^7;

sfr         BUS_SPEED   =           0xa1;

sfr         P_SW1       =           0xa2;
    sbit    S1_S1       =           P_SW1^7;
    sbit    S1_S0       =           P_SW1^6;
    sbit    CAN_S1      =           P_SW1^5;
    sbit    CAN_S0      =           P_SW1^4;
    sbit    SPI_S1      =           P_SW1^3;
    sbit    SPI_S0      =           P_SW1^2;
    sbit    LIN_S1      =           P_SW1^1;
    sbit    LIN_S0      =           P_SW1^0;

sfr         VRTRIM      =           0xa6;

sfr         IE          =           0xa8;
    sbit    EA          =           IE^7;
    sbit    ELVD        =           IE^6;
    sbit    EADC        =           IE^5;
    sbit    ES          =           IE^4;
    sbit    ET1         =           IE^3;
    sbit    EX1         =           IE^2;
    sbit    ET0         =           IE^1;
    sbit    EX0         =           IE^0;

sfr         SADDR       =           0xa9;
sfr         WKTCL       =           0xaa;
sfr         WKTCH       =           0xab;

sfr         S3CON       =           0xac;
    sbit    S3SM0       =           S3CON^7;
    sbit    S3ST3       =           S3CON^6;
    sbit    S3SM2       =           S3CON^5;
    sbit    S3REN       =           S3CON^4;
    sbit    S3TB8       =           S3CON^3;
    sbit    S3RB8       =           S3CON^2;
    sbit    S3TI        =           S3CON^1;
    sbit    S3RI        =           S3CON^0;

sfr         S3BUF       =           0xad;
sfr         TA          =           0xae;

sfr         IE2         =           0xaf;
    sbit    EUSB        =           IE2^7;
    sbit    ET4         =           IE2^6;
    sbit    ET3         =           IE2^5;
    sbit    ES4         =           IE2^4;
    sbit    ES3         =           IE2^3;
    sbit    ET2         =           IE2^2;
    sbit    ESPI        =           IE2^1;
    sbit    ES2         =           IE2^0;

sfr         P3          =           0xb0;
    sbit    P30         =           P3^0;
    sbit    P31         =           P3^1;
    sbit    P32         =           P3^2;
    sbit    P33         =           P3^3;
    sbit    P34         =           P3^4;
    sbit    P35         =           P3^5;
    sbit    P36         =           P3^6;
    sbit    P37         =           P3^7;

    sbit    RD          =           P3^7;
    sbit    WR          =           P3^6;
    sbit    T1          =           P3^5;
    sbit    T0          =           P3^4;
    sbit    INT1        =           P3^3;
    sbit    INT0        =           P3^2;
    sbit    TXD         =           P3^1;
    sbit    RXD         =           P3^0;

