louqingjie/PIE-Block/vendor/keil-toolchain/C251/INC/STC/STC8051U.H
#define     DMA_I2ST_AMTH           (*(unsigned char volatile far *)0x7efac0)
#define     DMA_I2ST_DONEH          (*(unsigned char volatile far *)0x7efac1)
#define     DMA_I2SR_AMTH           (*(unsigned char volatile far *)0x7efac2)
#define     DMA_I2SR_DONEH          (*(unsigned char volatile far *)0x7efac3)
#define     DMA_I2C_ITVH            (*(unsigned char volatile far *)0x7efac4)
#define     DMA_I2C_ITVL            (*(unsigned char volatile far *)0x7efac5)
#define     DMA_I2S_ITVH            (*(unsigned char volatile far *)0x7efac6)
#define     DMA_I2S_ITVL            (*(unsigned char volatile far *)0x7efac7)
#define     DMA_UR1_ITVH            (*(unsigned char volatile far *)0x7efac8)
#define     DMA_UR1_ITVL            (*(unsigned char volatile far *)0x7efac9)
#define     DMA_UR2_ITVH            (*(unsigned char volatile far *)0x7efaca)
#define     DMA_UR2_ITVL            (*(unsigned char volatile far *)0x7efacb)
#define     DMA_UR3_ITVH            (*(unsigned char volatile far *)0x7efacc)
#define     DMA_UR3_ITVL            (*(unsigned char volatile far *)0x7efacd)
#define     DMA_UR4_ITVH            (*(unsigned char volatile far *)0x7eface)
#define     DMA_UR4_ITVL            (*(unsigned char volatile far *)0x7efacf)

#define     DMA_QSPI_CFG            (*(unsigned char volatile far *)0x7efad0)
#define     DMA_QSPI_CR             (*(unsigned char volatile far *)0x7efad1)
#define     DMA_QSPI_STA            (*(unsigned char volatile far *)0x7efad2)
#define     DMA_QSPI_AMT            (*(unsigned char volatile far *)0x7efad3)
#define     DMA_QSPI_DONE           (*(unsigned char volatile far *)0x7efad4)
#define     DMA_QSPI_TXAH           (*(unsigned char volatile far *)0x7efad5)
#define     DMA_QSPI_TXAL           (*(unsigned char volatile far *)0x7efad6)
#define     DMA_QSPI_RXAH           (*(unsigned char volatile far *)0x7efad7)
#define     DMA_QSPI_RXAL           (*(unsigned char volatile far *)0x7efad8)
#define     DMA_QSPI_AMTH           (*(unsigned char volatile far *)0x7efadb)
#define     DMA_QSPI_DONEH          (*(unsigned char volatile far *)0x7efadc)
#define     DMA_QSPI_ITVH           (*(unsigned char volatile far *)0x7efade)
#define     DMA_QSPI_ITVL           (*(unsigned char volatile far *)0x7efadf)

#define     DMA_P2P_CR1             (*(unsigned char volatile far *)0x7efaf0)
#define     DMA_P2P_CR2             (*(unsigned char volatile far *)0x7efaf1)
#define     DMA_ARB_CFG             (*(unsigned char volatile far *)0x7efaf8)
#define     DMA_ARB_STA             (*(unsigned char volatile far *)0x7efaf9)

/////////////////////////////////////////////////
//7E:F900H-7E:F9FFH
/////////////////////////////////////////////////

#define     QSPI_CR1                (*(unsigned char volatile far *)0x7ef900)
#define     QSPI_CR2                (*(unsigned char volatile far *)0x7ef901)
#define     QSPI_CR3                (*(unsigned char volatile far *)0x7ef902)
#define     QSPI_CR4                (*(unsigned char volatile far *)0x7ef903)
#define     QSPI_DCR1               (*(unsigned char volatile far *)0x7ef904)
#define     QSPI_DCR2               (*(unsigned char volatile far *)0x7ef905)
#define     QSPI_SR1                (*(unsigned char volatile far *)0x7ef906)
#define     QSPI_SR2                (*(unsigned char volatile far *)0x7ef907)
#define     QSPI_FCR                (*(unsigned char volatile far *)0x7ef908)
#define     QSPI_HCR1               (*(unsigned char volatile far *)0x7ef909)
#define     QSPI_HCR2               (*(unsigned char volatile far *)0x7ef90a)
#define     QSPI_DLR1               (*(unsigned char volatile far *)0x7ef910)
#define     QSPI_DLR2               (*(unsigned char volatile far *)0x7ef911)
#define     QSPI_CCR1               (*(unsigned char volatile far *)0x7ef914)
#define     QSPI_CCR2               (*(unsigned char volatile far *)0x7ef915)
#define     QSPI_CCR3               (*(unsigned char volatile far *)0x7ef916)
#define     QSPI_CCR4               (*(unsigned char volatile far *)0x7ef917)
#define     QSPI_AR1                (*(unsigned char volatile far *)0x7ef918)
#define     QSPI_AR2                (*(unsigned char volatile far *)0x7ef919)
#define     QSPI_AR3                (*(unsigned char volatile far *)0x7ef91a)
#define     QSPI_AR4                (*(unsigned char volatile far *)0x7ef91b)
#define     QSPI_ABR                (*(unsigned char volatile far *)0x7ef91c)
#define     QSPI_DR                 (*(unsigned char volatile far *)0x7ef920)
#define     QSPI_PSMKR1             (*(unsigned char volatile far *)0x7ef924)
#define     QSPI_PSMAR1             (*(unsigned char volatile far *)0x7ef928)
#define     QSPI_PIR1               (*(unsigned char volatile far *)0x7ef92c)
#define     QSPI_PIR2               (*(unsigned char volatile far *)0x7ef92d)

#define     PWMA_ENO2               (*(unsigned char volatile far *)0x7ef930)
#define     PWMA_IOAUX2             (*(unsigned char volatile far *)0x7ef931)
#define     PWMA_CR3                (*(unsigned char volatile far *)0x7ef932)
#define     PWMA_SR3                (*(unsigned char volatile far *)0x7ef933)
#define     PWMA_CCER3              (*(unsigned char volatile far *)0x7ef934)
#define     PWMA_CCMR1X             (*(unsigned char volatile far *)0x7ef938)
#define     PWMA_CCMR2X             (*(unsigned char volatile far *)0x7ef939)
#define     PWMA_CCMR3X             (*(unsigned char volatile far *)0x7ef93a)
#define     PWMA_CCMR4X             (*(unsigned char volatile far *)0x7ef93b)
#define     PWMA_CCMR5              (*(unsigned char volatile far *)0x7ef93c)
#define     PWMA_CCMR5X             (*(unsigned char volatile far *)0x7ef93d)
#define     PWMA_CCMR6              (*(unsigned char volatile far *)0x7ef93e)
#define     PWMA_CCMR6X             (*(unsigned char volatile far *)0x7ef93f)
#define     PWMA_CCR5H              (*(unsigned char volatile far *)0x7ef940)
#define     PWMA_CCR5L              (*(unsigned char volatile far *)0x7ef941)
#define     PWMA_CCR5X              (*(unsigned char volatile far *)0x7ef942)
#define     PWMA_CCR6H              (*(unsigned char volatile far *)0x7ef943)
#define     PWMA_CCR6L              (*(unsigned char volatile far *)0x7ef944)
#define     PWMA_DER                (*(unsigned char volatile far *)0x7ef948)
#define     PWMA_DBA                (*(unsigned char volatile far *)0x7ef949)
#define     PWMA_DBL                (*(unsigned char volatile far *)0x7ef94a)
#define     PWMA_DMACR              (*(unsigned char volatile far *)0x7ef94b)

